{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature-evidence metadata mapping features to source files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing RollingCounter and WheelPicker components.",
  "frontend/index.css": "Tailwind setup with extensive CSS variables for light/dark themes and global styling.",
  "frontend/index.html": "HTML entry point mounting the app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures routes and wraps the app with theming, state providers, and sound effects.",
  "frontend/src/assets/generated.ts": "Exports paths to autogenerated image assets.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing background, content outlet, and bottom navigation.",
  "frontend/src/components/BackupRestorePanel.tsx": "UI for exporting and importing JSON backups with success/error toasts.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with icons, active highlighting, SFX, and haptics.",
  "frontend/src/components/DayDetailsSheet.tsx": "Sheet component displaying detailed daily stats including sessions and tags.",
  "frontend/src/components/EnergyOrb.tsx": "Canvas-based animated energy orb visualizing progress percentage.",
  "frontend/src/components/FatigueRing.tsx": "Canvas ring showing fatigue score with gradient and numeric display.",
  "frontend/src/components/FrostedBackground.tsx": "Animated blurred gradient canvas background reacting to window size.",
  "frontend/src/components/HistoryGraph365.tsx": "Draws an animated 365‑day line graph on a canvas and notifies which day was clicked.",
  "frontend/src/components/MetricCard.tsx": "Displays a styled card showing a metric value, title, optional icon, and subtitle.",
  "frontend/src/components/RankBadge.tsx": "Renders a decorative rank badge with optional particle effects and size variants.",
  "frontend/src/components/RankPromotionOverlay.tsx": "Shows a full‑screen rank‑up animation with sound, haptics, and auto‑dismiss.",
  "frontend/src/components/RecordCelebration.tsx": "Displays a temporary full‑screen celebration for achieving a new record with sound and haptic feedback.",
  "frontend/src/components/ResetDataDialog.tsx": "Provides a confirmation dialog to permanently reset all stored user data.",
  "frontend/src/components/RollingCounter.tsx": "Animates numeric value changes using an easing function for smooth transitions.",
  "frontend/src/components/SessionBuilder.tsx": "UI for selecting sets, reps, weight, and duration to build a session and return the result.",
  "frontend/src/components/StickmanVolumeControl.tsx": "Interactive draggable stickman that adjusts sound effect volume with haptic feedback.",
  "frontend/src/components/StreakFlame.tsx": "Draws an animated flame whose intensity scales with the user’s streak count.",
  "frontend/src/components/TagMultiSelect.tsx": "Allows selecting and toggling predefined tags displayed as badges.",
  "frontend/src/components/WheelPicker.tsx": "Implements a draggable, inertial scrolling number picker with snapping and sound effects.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login, logout, and persistence via a React context.",
  "frontend/src/hooks/usePullupStore.tsx": "Manages pull‑up sessions and user settings using IndexedDB, exposed through a React context.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating all data access is handled offline via usePullupStore.",
  "frontend/src/hooks/useRankProgress.ts": "Computes lifetime reps, current rank, next rank, and progress, with promotion detection logic.",
  "frontend/src/hooks/useSfx.tsx": "Provides sound‑effect playback and volume management synced with IndexedDB settings.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, custom utilities, and component styles for the app UI.",
  "frontend/src/lib/analytics.ts": "Calculates fatigue and consistency scores from recent pull‑up session data.",
  "frontend/src/lib/animations.ts": "Exports reusable motion animation presets such as pulse, fade‑in, and blur transitions.",
  "frontend/src/lib/backup.ts": "Handles exporting and importing app data backups via IndexedDB.",
  "frontend/src/lib/haptics.ts": "Defines vibration patterns and triggers haptic feedback using the Vibrations API.",
  "frontend/src/lib/offlineDb.ts": "Implements an IndexedDB wrapper for storing sessions and settings plus backup import/export.",
  "frontend/src/lib/predefinedTags.ts": "Defines a list of preset tags for labeling pull‑up sessions.",
  "frontend/src/lib/ranks.ts": "Provides rank definitions and helpers for determining rank, next rank, and progress based on total reps.",
  "frontend/src/lib/reset.ts": "Clears all offline data and reloads the app.",
  "frontend/src/lib/sfx.ts": "Loads and manages sound effects, offering play and volume control utilities.",
  "frontend/src/lib/stats.ts": "Computes daily stats, streaks, totals, averages, and personal records from pull‑up sessions.",
  "frontend/src/lib/types.ts": "Defines TypeScript interfaces for sessions, stats, settings, ranks, streaks, and records.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and Internet Identity providers.",
  "frontend/src/screens/AnalyticsScreen.tsx": "Displays analytics including rank, streaks, records, fatigue, and consistency metrics.",
  "frontend/src/screens/DashboardScreen.tsx": "Shows daily totals, rank progress, streak, fatigue, and goal progress with interactive effects.",
  "frontend/src/screens/HistoryScreen.tsx": "Displays 365‑day history stats, weekly/monthly summaries, personal records, and a detailed day sheet using stored pull-up sessions.",
  "frontend/src/screens/LogScreen.tsx": "Handles building and tagging workout sessions, saving them, checking rank promotions, and triggering PR celebrations.",
  "frontend/src/screens/SettingsScreen.tsx": "Provides controls for volume, daily goal, backup/restore, and data reset, including a wheel picker for goal adjustment.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the app’s project state, requirements, architecture notes, image assets, and existing feature metadata."
}