{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point.",
  "feature_evidence.json": "Feature evidence report documenting a date formatting change requirement for uppercase month names in frontend/src/lib/pstDate.ts.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, hooks, utilities, and screens including animations, sound effects, achievements, and UI elements.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system variables for light and dark themes, including sidebar, chart, and UI component colors.",
  "frontend/index.html": "HTML entry point loading Orbitron and Exo 2 fonts from Google Fonts and mounting the React app at #root.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with six routes (dashboard, log, history, analytics, advanced-stats, settings) and wrapping with theme, store, SFX, and focus mode providers.",
  "frontend/src/assets/generated.ts": "Asset path constants for generated images including rank badges, metal textures, stickman sprites, backgrounds, orbs, coins, chests, and card frames.",
  "frontend/src/components/achievements/AchievementCard.tsx": "Empty file for achievement card component.",
  "frontend/src/components/achievements/AchievementUnlockPopup.tsx": "Empty file for achievement unlock popup component.",
  "frontend/src/components/achievements/AchievementUnlockProvider.tsx": "Empty file for achievement unlock provider component.",
  "frontend/src/components/achievements/TrophyIcon.tsx": "Empty file for trophy icon component.",
  "frontend/src/components/AppShell.tsx": "Main layout component rendering frosted background, outlet for routed content, bottom navigation, and applying focus mode dimming effect.",
  "frontend/src/components/BackupRestorePanel.tsx": "Settings panel component for exporting/importing JSON backups of all app data with sound effects, haptic feedback, and error handling.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with five tabs (Dashboard, Log, History, Analytics, Settings) featuring active state styling, sound effects, haptics, and focus mode integration.",
  "frontend/src/components/chests/CardReveal.tsx": "Animated card flip component that reveals chest reward values with tier-specific colors and glow effects after a delay.",
  "frontend/src/components/chests/ChestOpenDialog.tsx": "Dialog component managing chest opening flow with three stages: confirmation, opening animation, and card reveal sequence with sound/haptic feedback.",
  "frontend/src/components/chests/ChestShopPanel.tsx": "Chest shop interface displaying user balance, chest purchase options, bonus modifier toggles, and recent chest opening history.",
  "frontend/src/components/chests/ChestTile.tsx": "Displays a clickable chest tile with tier-specific image, cost, card count, and lock icon when unaffordable. Plays sound and haptic feedback on purchase.",
  "frontend/src/components/coins/CoinBalanceBadge.tsx": "Fixed-position badge showing current coin balance with rolling counter animation, glow effect, and sound/haptic feedback when coins increase.",
  "frontend/src/components/DayDetailsSheet.tsx": "Sheet component displaying detailed daily statistics including total reps, individual sessions with sets, duration, weight, and tags.",
  "frontend/src/components/DisciplineScoreCard.tsx": "Card component displaying calculated discipline score as animated percentage with explanation text using RollingCounter animation.",
  "frontend/src/components/EnergyOrb.tsx": "Canvas-based animated orb visualization showing progress percentage with pulsing glow effects, trend-based velocity multipliers, and optional dimming.",
  "frontend/src/components/FatigueRing.tsx": "Renders a circular canvas-based fatigue meter with a gradient arc (green to yellow to red) that fills based on a 0-100 score, displaying the numeric value in the center.",
  "frontend/src/components/FrostedBackground.tsx": "Renders a full-screen animated canvas background with a slowly shifting gradient and blur effect, handling window resize events.",
  "frontend/src/components/GlowingRingMeter.tsx": "Displays an animated circular progress meter with a pulsing glow effect, smooth value transitions, and a centered numeric label.",
  "frontend/src/components/HistoryGraph365.tsx": "Renders a 365-day line graph of total reps on canvas with animated drawing, clickable data points, and day selection callback.",
  "frontend/src/components/HistoryGraphLifetime.tsx": "Displays a lifetime strength curve graph on canvas showing rolling max values over all sessions with animated gradient line drawing.",
  "frontend/src/components/InsightsPanel.tsx": "Displays AI-generated performance insights with confidence bars in a glass-card styled panel using the insights intelligence module.",
  "frontend/src/components/MetricCard.tsx": "A reusable card component displaying a metric title, value, optional icon, and subtitle with glass-card styling.",
  "frontend/src/components/MicroProgressCelebration.tsx": "Shows a temporary bottom-centered toast notification with a message and plays a micro-progress sound effect, auto-dismissing after 2 seconds.",
  "frontend/src/components/MilestoneCelebrationOverlay.tsx": "Full-screen overlay celebrating milestone achievements with trophy emoji, title, description, sound effect, and haptic feedback, auto-dismissing after 3 seconds.",
  "frontend/src/components/PredictedMaxPanel.tsx": "Displays strength predictions for 7, 30, and 90-day horizons with confidence percentages and overall trend indicator using adaptive strength calculations.",
  "frontend/src/components/RankBadge.tsx": "Renders an interactive hexagonal SVG rank badge with animated glow effects, gradient fills, holographic sweep, and tap feedback with sound/haptics.",
  "frontend/src/components/RankPromotionOverlay.tsx": "Full-screen overlay celebrating rank promotions with animated rank badge, sound effect, and haptic feedback, auto-dismissing after 3 seconds.",
  "frontend/src/components/ReadinessMeter.tsx": "Animated circular progress meter displaying readiness score with color-coded arc (green to red) and status text, using canvas for smooth animation.",
  "frontend/src/components/RecordCelebration.tsx": "Full-screen overlay that displays \"NEW RECORD!\" message with sound effects and haptic feedback, auto-dismissing after 2.5 seconds.",
  "frontend/src/components/ResetDataDialog.tsx": "Alert dialog component with confirmation prompt to permanently delete all user data including sessions, records, and settings.",
  "frontend/src/components/RollingCounter.tsx": "Animated number counter that smoothly transitions from current to target value using easeOutQuart easing over configurable duration.",
  "frontend/src/components/SessionBuilder.tsx": "Interactive form with wheel pickers for configuring workout session parameters (sets, reps, weight, duration) with focus mode and sound effects.",
  "frontend/src/components/SessionQualityOverlay.tsx": "Full-screen overlay displaying session quality score (ELITE/EXCELLENT/GREAT/GOOD) with sound effects, auto-dismissing after 2.5 seconds.",
  "frontend/src/components/StickmanPullupRig.tsx": "SVG-based animated stickman performing pull-ups with breathing animation when idle, dynamic arm/leg movement, and glow effect at high volume.",
  "frontend/src/components/StickmanVolumeControl.tsx": "Volume control interface combining vertical slider with animated stickman that performs pull-ups on volume changes, includes haptic feedback and tick sounds.",
  "frontend/src/components/StreakFlame.tsx": "Canvas-based animated flame effect that scales with streak count, using gradient colors and ellipse shapes with sinusoidal motion.",
  "frontend/src/components/SweatParticles.tsx": "Canvas-based particle system that spawns and animates green sweat droplets with gravity and fade-out effects when active.",
  "frontend/src/components/TagMultiSelect.tsx": "Multi-select tag component that displays predefined tags as toggleable badges with custom styling for selected/unselected states.",
  "frontend/src/components/VerticalVolumeSlider.tsx": "Vertical slider with draggable knob that provides haptic feedback and sound effects on step changes, includes scroll locking during drag.",
  "frontend/src/components/WheelPicker.tsx": "Scrollable wheel picker with inertia physics, snap-to-center behavior, boundary resistance, and sound effects for value selection.",
  "frontend/src/hooks/useAchievements.tsx": "Empty file placeholder for achievements hook functionality.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an Internet Computer actor with authentication, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useFocusMode.tsx": "Context provider and hook for managing global focus mode state (enter/exit) across the application.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using AuthClient.",
  "frontend/src/hooks/usePSTSync.ts": "Polls every 60 seconds to detect Pakistan Standard Time midnight transitions and notifies registered callbacks when the date changes.",
  "frontend/src/hooks/usePullupStore.tsx": "Main app state provider managing sessions, settings, and coins via IndexedDB with methods to add sessions, refresh data, and update settings.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting the app is fully offline and uses IndexedDB through usePullupStore instead of queries.",
  "frontend/src/hooks/useRankProgress.ts": "Calculates current rank, next rank, and progress based on lifetime total reps from sessions, with promotion detection logic.",
  "frontend/src/hooks/useScrollLock.ts": "Locks and unlocks page scrolling by manipulating body styles, preserving scroll position when locked.",
  "frontend/src/hooks/useSfx.tsx": "Context provider for sound effects management with volume control, persisting settings to IndexedDB and interfacing with sfxManager.",
  "frontend/src/index.css": "Global styles with Tailwind setup, CSS custom properties for dark theme, and keyframe animations for chest opening, coin bursts, card flips, and rank badges.",
  "frontend/src/lib/achievements/definitions.ts": "Empty file placeholder for achievement definitions.",
  "frontend/src/lib/achievements/detector.ts": "Empty file placeholder for achievement detection logic.",
  "frontend/src/lib/achievements/service.ts": "Empty file placeholder for achievement service functionality.",
  "frontend/src/lib/achievements/types.ts": "Empty file placeholder for achievement type definitions.",
  "frontend/src/lib/analytics.ts": "Calculates fatigue score (based on 7-day average vs today) and consistency score (days worked in last 30 days) from pullup sessions.",
  "frontend/src/lib/animations.ts": "Exports reusable animation configurations for pulse, fade-in-up, and blur transitions using Framer Motion syntax.",
  "frontend/src/lib/backup.ts": "Exports and imports backup data as JSON files by interfacing with offlineDb and using browser download/file upload mechanisms.",
  "frontend/src/lib/economy/chestOpenFlow.ts": "Orchestrates the chest opening transaction: deducts coins, draws cards with modifiers, persists records with PST dates, updates wallet, and handles rollback on errors.",
  "frontend/src/lib/economy/chestsTypes.ts": "Defines TypeScript types and constants for chest tiers (common, rare, epic), chest definitions, open records, card wallet items, and modifiers.",
  "frontend/src/lib/economy/coinRewards.ts": "Calculates coin rewards for pullup sessions based on reps, quality score, milestones, streak bonuses, and PR achievements.",
  "frontend/src/lib/economy/drawCards.ts": "Draws a specified number of cards for a chest tier using weighted probability tables modified by active modifiers.",
  "frontend/src/lib/economy/drawTables.ts": "Defines base probability tables for card values per chest tier and provides a weighted random draw helper function.",
  "frontend/src/lib/economy/economyService.ts": "Service layer that awards coins by calculating rewards from context and persisting them, tracking the last award event.",
  "frontend/src/lib/economy/economyStore.ts": "Centralized store operations for coins, chest history, card wallet, and modifiers, all backed by offlineDb.",
  "frontend/src/lib/economy/modifiers.ts": "Manages modifier state (streak, daily bonus) including updates after chest opens, checks for active modifiers, and applies probability adjustments.",
  "frontend/src/lib/haptics.ts": "Triggers haptic feedback patterns (light, medium, strong, special, chest-open, card-reveal) using the navigator.vibrate API.",
  "frontend/src/lib/intelligence/adaptiveStrength.ts": "Predicts future max pullup performance at 7, 30, and 90-day horizons with confidence scores based on recent trend analysis.",
  "frontend/src/lib/intelligence/advancedStats.ts": "Calculates advanced statistics including lifetime reps, most productive week, fastest improvement period, and strength velocity.",
  "frontend/src/lib/intelligence/discipline.ts": "Computes a discipline score (0-100) based on training consistency, streak stability, recent activity, and missed days over 60 days.",
  "frontend/src/lib/intelligence/fatigue.ts": "Calculates overall fatigue (0-100) from last 7 days based on volume, session frequency, and insufficient rest since last session.",
  "frontend/src/lib/intelligence/fatigueLoad.ts": "Computes separate muscular fatigue and nervous system load metrics using exponential decay over the last 14 days of sessions.",
  "frontend/src/lib/intelligence/insights.ts": "Generates performance insights from pull-up sessions, analyzing time-of-day performance, rest duration patterns, and training frequency to provide actionable recommendations with confidence scores.",
  "frontend/src/lib/intelligence/lifetimeStrengthCurve.ts": "Calculates a lifetime strength curve by tracking daily max reps and rolling maximum values over time to visualize long-term progress.",
  "frontend/src/lib/intelligence/longTermTrend.ts": "Analyzes long-term training trends by comparing first and second half averages of recent sessions, returning direction (up/stable/down), strength, and a velocity multiplier for progress visualization.",
  "frontend/src/lib/intelligence/microProgress.ts": "Detects micro-progress events by comparing new sessions against recent averages and personal bests, identifying incremental improvements and new records.",
  "frontend/src/lib/intelligence/milestones.ts": "Detects and creates milestone achievements based on lifetime totals (10, 100, 1000 reps), training streaks (7, 30 days), and session-to-session improvements.",
  "frontend/src/lib/intelligence/pressure.ts": "Calculates training pressure state based on days since last session, triggering warnings after 3+ days and computing intensity for motivational prompts.",
  "frontend/src/lib/intelligence/readiness.ts": "Computes a readiness score (0-100) and status (Peak/Ready/Moderate/Fatigued/Critical) based on recovery time, streak bonuses, fatigue, and recent training intensity, providing training recommendations.",
  "frontend/src/lib/intelligence/sessionQuality.ts": "Evaluates individual session quality by scoring consistency against recent averages, improvement relative to personal records, and fatigue management based on training frequency.",
  "frontend/src/lib/offlineDb.ts": "Manages IndexedDB for offline storage of sessions, settings, quality records, milestones, coins, chest history, card wallet, and modifiers with versioned schema migrations.",
  "frontend/src/lib/predefinedTags.ts": "Exports a predefined list of training session tags covering time of day, effort level, grip types, and training locations.",
  "frontend/src/lib/pstDate.ts": "Provides Pakistan Standard Time (UTC+5) date utilities for offline timezone conversion, formatting, parsing, and calculating time until midnight PST.",
  "frontend/src/lib/ranks.ts": "Defines a progression system with 17 rank tiers (Bronze to Ascendant) and provides utility functions to calculate current rank, next rank, and progress based on total reps.",
  "frontend/src/lib/reset.ts": "Exports a function to clear all offline database data and reload the page, effectively resetting the application state.",
  "frontend/src/lib/sfx.ts": "Manages sound effects for the application with a SfxManager class that loads, plays, stops, and controls volume for various game-like audio events (button clicks, chest opens, celebrations, etc.).",
  "frontend/src/lib/stats.ts": "Provides statistical calculation functions for pullup sessions including lifetime totals, daily aggregations, streak tracking, personal records, and time-based averages (weekly, monthly).",
  "frontend/src/lib/types.ts": "Defines TypeScript interfaces for the application's core data structures including pullup sessions, sets, daily stats, user settings, rank info, streaks, and personal records.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers, then renders the main App component.",
  "frontend/src/screens/AchievementsScreen.tsx": "Empty file placeholder for an achievements screen component.",
  "frontend/src/screens/AdvancedStatsScreen.tsx": "Displays advanced statistics including lifetime reps, total sessions, averages, strength velocity, most productive week, and fastest improvement period using calculated metrics.",
  "frontend/src/screens/AnalyticsScreen.tsx": "Shows comprehensive analytics with rank badge, lifetime stats, personal records, and readiness/fatigue metrics calculated from session history.",
  "frontend/src/screens/DashboardScreen.tsx": "Main dashboard displaying current rank badge, coin balance, rank progress bar, today's goal progress, and streak information with PST date synchronization.",
  "frontend/src/screens/HistoryScreen.tsx": "Displays pull-up history with a 365-day timeline, graphs (365-day and lifetime), and statistics cards showing weekly average, monthly total, and personal records. Uses formatPSTDateForDisplay to render dates in the timeline.",
  "frontend/src/screens/LogScreen.tsx": "Main session logging screen that handles pull-up session creation, tag selection, and displays celebrations for rank promotions, records, milestones, and micro-progress. Uses formatPSTDateForDisplay to show the current PST date and listens for midnight transitions.",
  "frontend/src/screens/SettingsScreen.tsx": "Settings interface for volume control, daily goal configuration, chest shop access, backup/restore functionality, and data reset options. Does not directly use date formatting functions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (app-bg, app-text, app-accent), border radius variables, box shadows, and keyframe animations for the application's design system.",
  "project_state.json": "Project metadata tracking feature requests to update date formatting in pstDate.ts to display month names in all uppercase letters (e.g., 'JANUARY' instead of current format)."
}