{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature evidence listing features, related files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Collection of short summaries describing many frontend components, hooks, and libraries.",
  "frontend/index.css": "Tailwind base and theme variables with light/dark color definitions and global styles.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app.",
  "frontend/src/App.tsx": "Sets up providers and defines the main router with all app routes.",
  "frontend/src/assets/generated.ts": "Exports paths for generated image assets used throughout the UI.",
  "frontend/src/components/achievements/AchievementCard.tsx": "Displays an achievement with icon, difficulty color, and hover effects, indicating locked or unlocked state.",
  "frontend/src/components/achievements/AchievementUnlockPopup.tsx": "Popup animation for unlocked achievements with sound effects, trophy display, and auto‑dismiss timer.",
  "frontend/src/components/achievements/AchievementUnlockProvider.tsx": "Manages a queue of achievement popups and exposes a context method to trigger them.",
  "frontend/src/components/achievements/TrophyIcon.tsx": "Maps string icon identifiers to Lucide or custom-rendered trophy visuals based on size and class props.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper adding background, focus mode dimming, and bottom navigation.",
  "frontend/src/components/BackupRestorePanel.tsx": "UI for exporting and importing JSON backups including coins and inventory data.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with icons, active highlighting, sounds, and haptics.",
  "frontend/src/components/chests/CardReveal.tsx": "Displays a timed flip animation revealing a card value with tier-based styling and optional completion callback.",
  "frontend/src/components/chests/ChestOpenDialog.tsx": "Handles the chest opening flow including confirmation, animations, card reveals, bonuses, and coin refresh.",
  "frontend/src/components/chests/ChestShopPanel.tsx": "Shows chest options, bonus toggles, and open history, and manages opening dialogs and modifier state.",
  "frontend/src/components/chests/ChestTile.tsx": "Renders a clickable chest tile showing cost and card count, disabled if the user can't afford it.",
  "frontend/src/components/coins/CoinBalanceBadge.tsx": "A floating coin counter badge that animates and plays effects when the balance increases.",
  "frontend/src/components/DayDetailsSheet.tsx": "Sheet showing detailed daily stats including sessions, reps, and tags.",
  "frontend/src/components/DisciplineScoreCard.tsx": "Displays a discipline score with percentage and explanation using a rolling counter.",
  "frontend/src/components/EnergyOrb.tsx": "Renders an animated orb on a canvas showing progress, trend effects, and a percentage label.",
  "frontend/src/components/FatigueRing.tsx": "Draws a circular fatigue indicator with gradient progress and a numeric score.",
  "frontend/src/components/FrostedBackground.tsx": "Creates a fullscreen animated gradient background with a frosted blur effect.",
  "frontend/src/components/GlowingRingMeter.tsx": "Shows an animated glowing ring meter for a numeric value with a label.",
  "frontend/src/components/HistoryGraph365.tsx": "Draws a 365‑day reps history line graph with animated reveal and click-to-select days.",
  "frontend/src/components/HistoryGraphLifetime.tsx": "Renders a lifetime strength curve graph with animated drawing based on session data.",
  "frontend/src/components/InsightsPanel.tsx": "Lists generated performance insights with confidence bars.",
  "frontend/src/components/MetricCard.tsx": "Simple card displaying a metric value with optional icon and subtitle.",
  "frontend/src/components/MicroProgressCelebration.tsx": "Temporary popup celebrating small progress with sound and auto-dismiss.",
  "frontend/src/components/MilestoneCelebrationOverlay.tsx": "Full-screen animated overlay celebrating a milestone with icon, text, and sound.",
  "frontend/src/components/PredictedMaxPanel.tsx": "Shows strength predictions for multiple horizons with confidence and trend.",
  "frontend/src/components/RankBadge.tsx": "Renders an animated hexagonal rank badge with glow, gradients, and tap effects using SVG and sound feedback.",
  "frontend/src/components/RankPromotionOverlay.tsx": "Displays a full-screen rank-up overlay with sound, haptics, and a large animated RankBadge before auto-dismiss.",
  "frontend/src/components/ReadinessMeter.tsx": "Draws an animated circular readiness meter on canvas with color-coded progress and score text.",
  "frontend/src/components/RecordCelebration.tsx": "Shows a brief full-screen celebration overlay for new records with sound, haptics, and animated text.",
  "frontend/src/components/ResetDataDialog.tsx": "Provides a confirmation dialog to reset all user data, handling async reset logic and UI states.",
  "frontend/src/components/RollingCounter.tsx": "Animates number transitions using an ease-out curve for smooth counting effects.",
  "frontend/src/components/SessionBuilder.tsx": "Builds a custom workout session with pickers for sets, reps, weight, and duration, managing focus mode and SFX.",
  "frontend/src/components/SessionQualityOverlay.tsx": "Shows a temporary overlay displaying session quality with sound, an animated score, and contextual message.",
  "frontend/src/components/StickmanPullupRig.tsx": "Renders an animated SVG stickman performing pull-ups with breathing, motion, and glow effects driven by progress and volume.",
  "frontend/src/components/StickmanVolumeControl.tsx": "A volume control component with pull-up animation, haptics, tick sounds, and color‑changing display tied to a vertical slider.",
  "frontend/src/components/StreakFlame.tsx": "Canvas‑rendered animated flame that scales intensity and displays the current streak value.",
  "frontend/src/components/SweatParticles.tsx": "Canvas particle system that spawns and animates sweat droplets when active.",
  "frontend/src/components/TagMultiSelect.tsx": "Renders a set of predefined tags as selectable badges with toggle behavior.",
  "frontend/src/components/VerticalVolumeSlider.tsx": "A draggable vertical slider that updates volume, detects step changes, and handles drag interactions globally.",
  "frontend/src/components/WheelPicker.tsx": "A scroll‑wheel number picker with inertia, snapping, resistance at bounds, and tick sound feedback.",
  "frontend/src/hooks/useAchievements.tsx": "Provides context for unlocked achievement IDs and a method to refresh them from the service.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useFocusMode.tsx": "Tracks and exposes focus mode state through a simple context with enter and exit functions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for Internet Identity auth, creating AuthClient, loading stored identities, and exposing login state and actions.",
  "frontend/src/hooks/usePullupStore.tsx": "Manages offline pull-up sessions, user settings, and coins via IndexedDB, exposing CRUD functions through context.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating all data access is handled by usePullupStore.",
  "frontend/src/hooks/useRankProgress.ts": "Computes rank, next rank, and progress from session totals and exposes promotion checks.",
  "frontend/src/hooks/useScrollLock.ts": "Locks and restores page scroll state based on a boolean flag.",
  "frontend/src/hooks/useSfx.tsx": "Provides sound effects context managing volume, play/stop actions, and persistence in IndexedDB.",
  "frontend/src/index.css": "Global styles, Tailwind layers, color variables, and complex animations for ranks and UI effects.",
  "frontend/src/lib/achievements/definitions.ts": "Defines all achievement metadata and unlock conditions for reps, streaks, sets, and other metrics.",
  "frontend/src/lib/achievements/detector.ts": "Detects newly unlocked achievements based on context and previously unlocked records.",
  "frontend/src/lib/achievements/service.ts": "Checks for new achievements, saves unlocks to storage, and provides lookup utilities.",
  "frontend/src/lib/achievements/types.ts": "Type definitions for achievements, unlock records, and evaluation context.",
  "frontend/src/lib/analytics.ts": "Calculates fatigue and consistency scores from recent session statistics and exposes formula text.",
  "frontend/src/lib/animations.ts": "Exports reusable animation configuration objects for UI transitions.",
  "frontend/src/lib/backup.ts": "Handles exporting and importing full offline database backups as JSON files.",
  "frontend/src/lib/economy/chestOpenFlow.ts": "Handles chest opening: deducts coins, draws cards using modifiers, updates state, saves history, and refunds on failure.",
  "frontend/src/lib/economy/chestsTypes.ts": "Defines chest tiers, structures for chest data, wallet items, modifiers, and static chest definitions.",
  "frontend/src/lib/economy/coinRewards.ts": "Calculates coin rewards based on session reps, quality, milestones, achievements, streaks, and PRs.",
  "frontend/src/lib/economy/drawCards.ts": "Draws chest cards by applying modifiers to probability tables and performing weighted draws.",
  "frontend/src/lib/economy/drawTables.ts": "Provides base probability tables for each chest tier and a weighted random draw helper.",
  "frontend/src/lib/economy/economyService.ts": "Applies calculated coin rewards, updates coin balance, and tracks the last award event.",
  "frontend/src/lib/economy/economyStore.ts": "Manages offline coin balance, chest history, wallet items, and modifier persistence.",
  "frontend/src/lib/economy/modifiers.ts": "Implements streak and daily bonus logic and adjusts draw probabilities accordingly.",
  "frontend/src/lib/haptics.ts": "Defines vibration patterns and exposes a helper to trigger haptic feedback.",
  "frontend/src/lib/intelligence/adaptiveStrength.ts": "Generates multi‑horizon strength predictions based on recent session trends and data quality.",
  "frontend/src/lib/intelligence/advancedStats.ts": "Computes advanced training statistics including totals, productive weeks, improvement periods, and velocity.",
  "frontend/src/lib/intelligence/discipline.ts": "Calculates a discipline score from streaks, recent activity, and consistency, with an explanatory label.",
  "frontend/src/lib/intelligence/fatigueLoad.ts": "Estimates muscular and nervous system fatigue from recent sessions with decay over time.",
  "frontend/src/lib/intelligence/insights.ts": "Generates performance insights from pull-up sessions, analyzing time-of-day, rest duration, and training frequency patterns.",
  "frontend/src/lib/intelligence/lifetimeStrengthCurve.ts": "Builds a lifetime strength curve by computing daily max reps and a rolling max from session history.",
  "frontend/src/lib/intelligence/longTermTrend.ts": "Calculates long-term performance direction and strength by comparing recent training averages.",
  "frontend/src/lib/intelligence/microProgress.ts": "Detects small improvements or personal records by comparing a new session to recent averages and historical bests.",
  "frontend/src/lib/intelligence/milestones.ts": "Identifies new milestones based on lifetime totals, streaks, and major single-session improvements.",
  "frontend/src/lib/intelligence/pressure.ts": "Computes training pressure based on days since last session, flagging warnings and intensity levels.",
  "frontend/src/lib/intelligence/readiness.ts": "Generates a readiness score using fatigue, streaks, recent intensity, and recovery time to recommend training load.",
  "frontend/src/lib/intelligence/sessionQuality.ts": "Scores a session's quality using consistency, improvement relative to PRs, and fatigue indicators.",
  "frontend/src/lib/offlineDb.ts": "Implements an IndexedDB-backed offline database for sessions, settings, milestones, achievements, coins, and chest data.",
  "frontend/src/lib/predefinedTags.ts": "Exports a static list of preset tags for annotating pull-up sessions.",
  "frontend/src/lib/ranks.ts": "Defines rank tiers based on total reps and provides helpers for rank lookup and progress calculation.",
  "frontend/src/lib/reset.ts": "Clears all offline data and reloads the app.",
  "frontend/src/lib/sfx.ts": "Defines sound effect types and a manager that loads audio files, plays/stops them, and controls volume and looping.",
  "frontend/src/lib/stats.ts": "Provides helper functions to compute daily totals, streaks, averages, and personal pull‑up records from session data.",
  "frontend/src/lib/types.ts": "Declares TypeScript interfaces for pull‑up sets, sessions, stats, user settings, ranks, streaks, and personal records.",
  "frontend/src/main.tsx": "Application entrypoint that initializes React, React Query, identity provider, and renders the root App component.",
  "frontend/src/screens/AchievementsScreen.tsx": "Displays achievements with filtering, unlock status, scrolling list, and a selectable detail panel.",
  "frontend/src/screens/AdvancedStatsScreen.tsx": "Shows advanced workout statistics including lifetime totals, averages, strength metrics, and productivity insights.",
  "frontend/src/screens/AnalyticsScreen.tsx": "Renders analytics such as rank progress, streaks, averages, fatigue, readiness, predictions, and other performance metrics.",
  "frontend/src/screens/DashboardScreen.tsx": "Main dashboard presenting today’s totals, rank badge, streak, fatigue, readiness, and goal progress.",
  "frontend/src/screens/HistoryScreen.tsx": "Displays daily, weekly, monthly, and lifetime workout stats with graphs, personal records, and a day-details sheet.",
  "frontend/src/screens/LogScreen.tsx": "Handles session logging, tagging, saving, analytics, achievements, milestones, and celebration overlays.",
  "frontend/src/screens/SettingsScreen.tsx": "Provides controls for volume, daily goals, chest shop, backups, and data reset within a styled settings UI.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the app’s UI styling.",
  "project_state.json": "Describes the app’s offline-first design, features, architecture, known issues, and required image assets."
}