{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Pullups Tracker (Offline, wheel-only, luxury UI, ranks, analytics, backup/restore)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement an offline-first local data layer for unlimited pull-up logs with no dependency on network calls.",
      "acceptanceCriteria": [
        "Creating, editing, and viewing logs works with the network disconnected.",
        "All data persists across browser refreshes and app restarts using local device storage (not the backend).",
        "The app does not block any core screen behind network calls."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/offlineDb.ts",
          "operation": "create",
          "description": "Create a local-only persistence module (e.g., IndexedDB-backed) for logs, derived aggregates, and user settings; ensure operations are resilient and do not require any backend capability."
        },
        {
          "path": "frontend/src/lib/types.ts",
          "operation": "create",
          "description": "Define TypeScript types for pull-up sessions, sets, tags, settings, rank state, and computed metrics used throughout the app to keep the offline data layer consistent."
        },
        {
          "path": "frontend/src/hooks/usePullupStore.ts",
          "operation": "create",
          "description": "Create a React hook/state layer that reads/writes exclusively to the offline DB, exposes optimistic updates, and provides selectors for dashboard/history/analytics without forcing network requests."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Wire the app-wide offline store provider (and any needed initialization) so core screens can render immediately from local storage and never block on network calls."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a manual user-initiated backup export/import flow with clear success/failure states and safe restore semantics.",
      "acceptanceCriteria": [
        "Settings includes actions to Export Backup and Restore Backup.",
        "Export produces a downloadable file containing all logs and settings needed to restore the app state.",
        "Restore imports a previously exported file and fully reconstructs the local database.",
        "If the imported file is invalid/corrupt, the app shows an error and does not partially overwrite existing data."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/backup.ts",
          "operation": "create",
          "description": "Implement serialization (export) and validation + transactional restore (import) helpers for the offline DB; ensure invalid backups fail without partially overwriting existing data."
        },
        {
          "path": "frontend/src/screens/SettingsScreen.tsx",
          "operation": "create",
          "description": "Implement Settings actions for Export Backup and Restore Backup with explicit success/failure UI states; use shadcn-ui dialog/toast primitives for confirmations/alerts. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/BackupRestorePanel.tsx",
          "operation": "create",
          "description": "Create a dedicated Settings subcomponent to encapsulate export/download and restore/file-picker flow, including progress/guard rails and non-destructive error handling; use shadcn-ui components for consistent premium UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "create",
          "description": "Create the app shell and register Settings in the navigation so the backup/restore UI is reachable from within the app."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Enforce a strict no-keyboard UX by replacing all inputs with wheel pickers and tag selection (no typing anywhere).",
      "acceptanceCriteria": [
        "No screen uses editable text fields, textareas, or numeric inputs that trigger the OS keyboard.",
        "Logging sets/reps/duration/weight is possible only through wheel pickers.",
        "Wheel picker has inertial scrolling, snaps to discrete values, highlights the centered selection, and plays a tick SFX on selection changes.",
        "Notes are selectable tags (multi-select) and do not allow arbitrary text entry."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WheelPicker.tsx",
          "operation": "create",
          "description": "Create a vertical wheel picker component supporting inertial scrolling, snapping to discrete values, a centered highlight glow, and change callbacks suitable for all numeric selections (sets, reps, duration, weight)."
        },
        {
          "path": "frontend/src/components/TagMultiSelect.tsx",
          "operation": "create",
          "description": "Create a predefined tag multi-select component (no freeform text) for session notes; use shadcn-ui chips/badges/buttons styling patterns (compose, do not edit immutable sources). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/predefinedTags.ts",
          "operation": "create",
          "description": "Define the fixed list of selectable note tags and any grouping needed for the no-keyboard notes system."
        },
        {
          "path": "frontend/src/screens/LogScreen.tsx",
          "operation": "create",
          "description": "Implement logging UI using WheelPicker for all numeric fields and TagMultiSelect for notes; ensure there are no text/numeric inputs that can trigger the OS keyboard."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Create the core navigation and five screens with icon-based minimal UI and smooth blur/depth transitions.",
      "acceptanceCriteria": [
        "All five sections are accessible via a consistent navigation component.",
        "Transitions between screens include smooth blur/depth motion (no abrupt route changes).",
        "No placeholder sections; each screen renders real data from local storage."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "create",
          "description": "Create the main layout shell with minimal icon-based navigation and a content area designed for blur/depth transitions; use shadcn-ui base primitives where appropriate (compose only). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/BottomNav.tsx",
          "operation": "create",
          "description": "Implement a consistent icon-based minimal navigation component for Dashboard/Log/History/Analytics/Settings with premium press micro-interactions; use shadcn-ui button primitives (compose only). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ScreenTransition.tsx",
          "operation": "create",
          "description": "Implement a reusable transition wrapper that applies blur/depth animations when switching between sections to avoid abrupt screen changes."
        },
        {
          "path": "frontend/src/screens/DashboardScreen.tsx",
          "operation": "create",
          "description": "Create Dashboard screen rendering real local data and luxury widgets (wired in later requirements)."
        },
        {
          "path": "frontend/src/screens/HistoryScreen.tsx",
          "operation": "create",
          "description": "Create History screen rendering real local data and graph/details (wired in later requirements)."
        },
        {
          "path": "frontend/src/screens/AnalyticsScreen.tsx",
          "operation": "create",
          "description": "Create Analytics screen rendering real local data and metric cards (wired in later requirements)."
        },
        {
          "path": "frontend/src/screens/SettingsScreen.tsx",
          "operation": "modify",
          "description": "Ensure Settings screen exists and is wired into navigation; integrate panels for backup/restore, volume control, and reset data without any keyboard-triggering inputs."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire AppShell, BottomNav, and all five screens with smooth transitions so each section is reachable and renders immediately from offline data."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Build the luxury animated Dashboard with rolling counter, rank badge, streak flame, fatigue ring, energy orb, and animated frosted background.",
      "acceptanceCriteria": [
        "Today’s pull-ups total updates immediately after logging and animates upward with a rolling counter effect.",
        "Rank badge is shown as a metallic hexagon with animated shine and inner glow.",
        "Streak is displayed with a flame animation that responds to streak state.",
        "Fatigue indicator renders as a ring with an animated progress/level display driven by computed fatigue score.",
        "Orb energy core fill level reflects progress toward a configurable daily goal and animates smoothly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/assets/generated.ts",
          "operation": "create",
          "description": "Centralize references to generated image assets for use across the UI, including: frontend/public/assets/generated/hex-badge-base.dim_512x512.png, frontend/public/assets/generated/metal-bronze.dim_1024x1024.png, frontend/public/assets/generated/metal-silver.dim_1024x1024.png, frontend/public/assets/generated/metal-gold.dim_1024x1024.png, frontend/public/assets/generated/metal-platinum.dim_1024x1024.png, frontend/public/assets/generated/metal-diamond.dim_1024x1024.png, frontend/public/assets/generated/metal-elite.dim_1024x1024.png, frontend/public/assets/generated/metal-ascendant.dim_1024x1024.png, frontend/public/assets/generated/bg-frosted-gradient.dim_1440x2560.png, frontend/public/assets/generated/flame-sprite.dim_1024x1024.png, frontend/public/assets/generated/orb-core.dim_1024x1024.png."
        },
        {
          "path": "frontend/src/components/RollingCounter.tsx",
          "operation": "create",
          "description": "Implement a performant rolling counter component for today’s total that animates upward on value changes without jank."
        },
        {
          "path": "frontend/src/components/RankBadge.tsx",
          "operation": "create",
          "description": "Implement the metallic hexagon rank badge component using frontend/public/assets/generated/hex-badge-base.dim_512x512.png and the appropriate metal texture tiles; include animated shine and inner glow."
        },
        {
          "path": "frontend/src/components/StreakFlame.tsx",
          "operation": "create",
          "description": "Implement streak flame animation using the sprite sheet frontend/public/assets/generated/flame-sprite.dim_1024x1024.png, responsive to streak state."
        },
        {
          "path": "frontend/src/components/FatigueRing.tsx",
          "operation": "create",
          "description": "Implement an animated ring indicator component driven by computed fatigue score; optimize rendering (e.g., SVG/canvas) for mobile smoothness."
        },
        {
          "path": "frontend/src/components/EnergyOrb.tsx",
          "operation": "create",
          "description": "Implement an orb-style energy core widget using frontend/public/assets/generated/orb-core.dim_1024x1024.png with smooth fill animation toward daily goal."
        },
        {
          "path": "frontend/src/components/FrostedBackground.tsx",
          "operation": "create",
          "description": "Implement the subtle animated gradient/depth blur background, incorporating frontend/public/assets/generated/bg-frosted-gradient.dim_1440x2560.png as a background plate."
        },
        {
          "path": "frontend/src/screens/DashboardScreen.tsx",
          "operation": "modify",
          "description": "Compose RollingCounter, RankBadge, StreakFlame, FatigueRing, EnergyOrb, and FrostedBackground into the Dashboard, wired to live offline data updates."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Implement the premium wheel-based Log flow with optional fields, predefined tags, save persistence, SFX, haptics, and a pulse confirmation animation.",
      "acceptanceCriteria": [
        "A user can log a session with multiple sets (each with reps) using wheel pickers only.",
        "Optional duration and weight can be included via wheel pickers (and omitted).",
        "A save action writes to local storage and immediately updates dashboard totals.",
        "On successful save, the app plays the save chime SFX, triggers medium haptic vibration (when supported), and shows a pulse animation confirmation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SessionBuilder.tsx",
          "operation": "create",
          "description": "Create a wheel-only session builder UI that lets users select number of sets and reps per set (and optional duration/weight) using WheelPicker; no keyboard-triggering inputs allowed."
        },
        {
          "path": "frontend/src/lib/haptics.ts",
          "operation": "create",
          "description": "Implement a small utility for vibration patterns (light/medium/strong/special) with graceful degradation when vibration is unsupported."
        },
        {
          "path": "frontend/src/lib/animations.ts",
          "operation": "create",
          "description": "Create reusable animation helpers (e.g., pulse confirmation, blur/depth easing tokens) to keep UI motion consistent and performant."
        },
        {
          "path": "frontend/src/screens/LogScreen.tsx",
          "operation": "modify",
          "description": "Wire SessionBuilder + TagMultiSelect to offline save; on successful save trigger save chime SFX, medium haptic, and pulse confirmation animation, and ensure dashboard totals update immediately from local state."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Create History with a 365-day animated graph, tappable day details, and computed weekly/monthly/record summaries from local data.",
      "acceptanceCriteria": [
        "Graph renders exactly 365 days (or fewer if the user has less history) and animates the line drawing on screen entry.",
        "User can tap/click on any day data point and see a details panel with that day’s sessions/sets.",
        "Weekly average and monthly total are computed from stored logs and displayed.",
        "Personal records (e.g., highest daily total, highest single-session total) are computed and displayed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HistoryGraph365.tsx",
          "operation": "create",
          "description": "Implement a smooth animated 365-day graph (SVG/canvas) that draws left-to-right on entry and supports tapping points to select a day."
        },
        {
          "path": "frontend/src/components/DayDetailsSheet.tsx",
          "operation": "create",
          "description": "Implement a day details panel (sheet/dialog) showing sessions/sets for the selected day; use shadcn-ui sheet/dialog primitives (compose only). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/stats.ts",
          "operation": "create",
          "description": "Add pure deterministic helpers to compute daily totals, weekly average, monthly total, and personal record values from offline logs."
        },
        {
          "path": "frontend/src/screens/HistoryScreen.tsx",
          "operation": "modify",
          "description": "Wire HistoryGraph365 and DayDetailsSheet to offline data, and render weekly/monthly/PR summaries derived from stored logs (no placeholder values)."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Implement Analytics metrics and trigger personal record celebration (visual + SFX + haptic) when new records are achieved.",
      "acceptanceCriteria": [
        "All metrics render from local data (no hardcoded sample values).",
        "Fatigue score and consistency score are deterministic and update as data changes (provide an in-UI info/description of the formula).",
        "When a new personal record is logged, the app triggers a celebration animation, plays the PR bass pulse SFX, and triggers a strong/special vibration where supported."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/analytics.ts",
          "operation": "create",
          "description": "Implement deterministic calculations for max pullups ever, streaks, daily average, fatigue score, consistency score, and rank progress from offline logs; include human-readable formula descriptions for UI display."
        },
        {
          "path": "frontend/src/components/MetricCard.tsx",
          "operation": "create",
          "description": "Create a premium metric card component for analytics display; use shadcn-ui card primitives (compose only). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/RecordCelebration.tsx",
          "operation": "create",
          "description": "Implement the PR celebration visuals/animation trigger surface; it should be invokable when the app detects a new record after saving a session."
        },
        {
          "path": "frontend/src/screens/AnalyticsScreen.tsx",
          "operation": "modify",
          "description": "Render all analytics metrics from local data and include in-UI formula explanations for fatigue and consistency; wire RecordCelebration to PR detection."
        },
        {
          "path": "frontend/src/screens/LogScreen.tsx",
          "operation": "modify",
          "description": "After saving a session, detect whether a new personal record was achieved and trigger the PR celebration (visual + deep bass pulse SFX + strong/special haptic)."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Implement full rank ladder with animated metallic hex badges, particle aura, promotion animation, and rank progress shown on Dashboard and Analytics.",
      "acceptanceCriteria": [
        "All listed ranks exist and can be reached as the user’s tracked performance increases.",
        "Badge visuals include metallic texture + moving shine + inner glow + particle aura.",
        "When rank changes upward, the promotion animation plays and the rank promotion impact SFX triggers with strong haptics (where supported).",
        "Rank progress is shown as a clear progress indicator toward the next rank."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/ranks.ts",
          "operation": "create",
          "description": "Define the full rank ladder (Bronze III → Ascendant), thresholds, and progress computation rules based on accumulated offline performance."
        },
        {
          "path": "frontend/src/components/ParticleAura.tsx",
          "operation": "create",
          "description": "Implement a lightweight particle aura effect (canvas/SVG) that can be attached to RankBadge without degrading mobile performance."
        },
        {
          "path": "frontend/src/components/RankPromotionOverlay.tsx",
          "operation": "create",
          "description": "Implement the rank promotion animation overlay (explosion/impact feel) that can be triggered when rank increases."
        },
        {
          "path": "frontend/src/components/RankBadge.tsx",
          "operation": "modify",
          "description": "Enhance RankBadge to include metal texture, inner glow, moving shine reflection, and integrate ParticleAura; ensure the appropriate metal texture tile is used per rank from: frontend/public/assets/generated/metal-bronze.dim_1024x1024.png, frontend/public/assets/generated/metal-silver.dim_1024x1024.png, frontend/public/assets/generated/metal-gold.dim_1024x1024.png, frontend/public/assets/generated/metal-platinum.dim_1024x1024.png, frontend/public/assets/generated/metal-diamond.dim_1024x1024.png, frontend/public/assets/generated/metal-elite.dim_1024x1024.png, frontend/public/assets/generated/metal-ascendant.dim_1024x1024.png."
        },
        {
          "path": "frontend/src/hooks/useRankProgress.ts",
          "operation": "create",
          "description": "Create a hook that computes current rank, progress to next rank, and detects promotions based on offline logs and rank rules."
        },
        {
          "path": "frontend/src/screens/DashboardScreen.tsx",
          "operation": "modify",
          "description": "Show current rank and a clear progress indicator toward the next rank using offline-derived rank state."
        },
        {
          "path": "frontend/src/screens/AnalyticsScreen.tsx",
          "operation": "modify",
          "description": "Display rank progress and details in Analytics, using the same rank computation and RankBadge visuals as Dashboard."
        },
        {
          "path": "frontend/src/screens/LogScreen.tsx",
          "operation": "modify",
          "description": "On save, detect upward rank changes and trigger RankPromotionOverlay plus rank promotion impact SFX and strong haptics."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add a sound effects (SFX-only) system with required SFX events and a global volume control affecting all SFX.",
      "acceptanceCriteria": [
        "No music/audio loops are present anywhere in the app.",
        "Each listed SFX is present as an audio asset and is triggered at the correct interaction/event.",
        "Global volume affects all SFX consistently.",
        "Audio playback failures are handled gracefully (no crashes)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/sfx/button-click.mp3",
          "operation": "create",
          "description": "Add the button click SFX asset (SFX-only, no music)."
        },
        {
          "path": "frontend/public/assets/sfx/wheel-tick.mp3",
          "operation": "create",
          "description": "Add the wheel tick SFX asset (SFX-only, no music)."
        },
        {
          "path": "frontend/public/assets/sfx/save-chime.mp3",
          "operation": "create",
          "description": "Add the data save chime SFX asset (SFX-only, no music)."
        },
        {
          "path": "frontend/public/assets/sfx/rank-promotion-impact.mp3",
          "operation": "create",
          "description": "Add the rank promotion impact SFX asset (SFX-only, no music)."
        },
        {
          "path": "frontend/public/assets/sfx/streak-ignition-flame.mp3",
          "operation": "create",
          "description": "Add the streak ignition flame SFX asset (SFX-only, no music)."
        },
        {
          "path": "frontend/public/assets/sfx/metal-touch.mp3",
          "operation": "create",
          "description": "Add the metal touch SFX asset (SFX-only, no music)."
        },
        {
          "path": "frontend/public/assets/sfx/pr-bass-pulse.mp3",
          "operation": "create",
          "description": "Add the deep bass pulse SFX asset for personal record celebration (SFX-only, no music)."
        },
        {
          "path": "frontend/src/lib/sfx.ts",
          "operation": "create",
          "description": "Implement an SFX manager (no music, no loops) that loads the listed SFX assets, applies a global volume multiplier, and fails gracefully if playback is blocked/unavailable."
        },
        {
          "path": "frontend/src/hooks/useSfx.ts",
          "operation": "create",
          "description": "Create a hook/provider to expose SFX playback functions and global volume state to the app."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Wire the SFX provider globally so all screens/components can trigger SFX consistently and respect global volume."
        },
        {
          "path": "frontend/src/components/WheelPicker.tsx",
          "operation": "modify",
          "description": "Trigger the wheel tick SFX on selection changes via the global SFX system while preserving smooth scrolling performance."
        },
        {
          "path": "frontend/src/components/BottomNav.tsx",
          "operation": "modify",
          "description": "Trigger button click (and optionally metal touch where thematically appropriate) SFX on navigation taps through the global SFX system; use shadcn-ui button primitives (compose only). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/LogScreen.tsx",
          "operation": "modify",
          "description": "Trigger save chime SFX on successful save; ensure no crashes if audio playback fails."
        },
        {
          "path": "frontend/src/screens/DashboardScreen.tsx",
          "operation": "modify",
          "description": "Trigger streak ignition flame SFX when streak transitions into an ignited/active state (as defined by streak computation)."
        },
        {
          "path": "frontend/src/screens/AnalyticsScreen.tsx",
          "operation": "modify",
          "description": "Trigger PR bass pulse SFX when RecordCelebration is fired."
        },
        {
          "path": "frontend/src/components/RankPromotionOverlay.tsx",
          "operation": "modify",
          "description": "Trigger rank promotion impact SFX when the promotion animation plays."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Implement Settings stickman pull-up volume control (no slider) with physics-like animation, max-pull reset behavior, and Reset Data with premium confirmation animation.",
      "acceptanceCriteria": [
        "Settings includes the stickman volume control and no traditional slider UI is used for volume.",
        "Dragging upward increases volume continuously; releasing behaves naturally with physics-like easing.",
        "When volume reaches 100%, the stickman drops automatically, volume resets to 0, and the special max-pull vibration triggers (when supported).",
        "Reset Data requires confirmation and plays a distinct confirmation animation before wiping local storage.",
        "After reset, all screens reflect an empty state without errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StickmanVolumeControl.tsx",
          "operation": "create",
          "description": "Implement the interactive stickman pull-up volume control using frontend/public/assets/generated/stickman-pullup.dim_1024x512.png; support drag-to-increase, physics-like easing, and the max-pull auto-drop reset behavior (volume -> 0)."
        },
        {
          "path": "frontend/src/screens/SettingsScreen.tsx",
          "operation": "modify",
          "description": "Integrate StickmanVolumeControl and bind it to the global SFX volume state; implement Reset Data with confirmation UI and a premium confirmation animation using shadcn-ui dialog primitives (compose only). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/reset.ts",
          "operation": "create",
          "description": "Implement a safe local reset helper that wipes offline DB + settings and triggers a UI refresh so all screens show empty-state correctly."
        },
        {
          "path": "frontend/src/components/ResetDataDialog.tsx",
          "operation": "create",
          "description": "Create a premium confirmation flow component for Reset Data, including a distinct confirmation animation before invoking the reset helper; use shadcn-ui dialog primitives (compose only). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Apply the luxury glassmorphism visual system and exact palette across the app with pervasive motion and premium micro-interactions.",
      "acceptanceCriteria": [
        "All major UI surfaces (app background, cards, buttons, text, accents) use the provided hex colors as the authoritative palette.",
        "Wheel picker styling matches the provided wheel picker palette (background, selected/unselected colors, center glow).",
        "Buttons have pressed depth animation and use the specified normal/pressed colors.",
        "Micro-interactions are present across navigation and primary controls (press, hover/active states where applicable) without introducing jank."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "create",
          "description": "Create global styles using Tailwind + CSS variables to encode the authoritative palette, glassmorphism surfaces, soft shadows, depth layers, and motion tokens; ensure wheel picker and buttons match the specified palette and pressed states."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend theme tokens (colors/shadows/animations) to support the luxury palette and consistent depth/blur/motion styling across screens without introducing heavy custom CSS."
        },
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Apply global layout styling (glass panels, depth layers, minimal cold futuristic feel) and ensure transitions/micro-interactions feel 'alive' without jank."
        },
        {
          "path": "frontend/src/components/WheelPicker.tsx",
          "operation": "modify",
          "description": "Apply wheel picker palette styling (background, selected/unselected, center highlight glow) and pressed/active micro-interactions without using any keyboard-triggering inputs."
        },
        {
          "path": "frontend/src/components/BottomNav.tsx",
          "operation": "modify",
          "description": "Ensure navigation visuals are minimal/icon-based, glassy, and responsive with pressed depth animation using shadcn-ui primitives (compose only). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Add haptic feedback patterns (light/medium/strong/special) with graceful fallback when unsupported.",
      "acceptanceCriteria": [
        "Button presses trigger light haptic feedback (when supported).",
        "Saving a log triggers medium haptic feedback (when supported).",
        "Rank promotion triggers strong haptic feedback (when supported).",
        "Volume max pull event triggers the special vibration (when supported).",
        "When vibration is unsupported, no errors occur and the UX remains usable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/haptics.ts",
          "operation": "modify",
          "description": "Expand/confirm vibration patterns for light, medium, strong, and special events; ensure all calls are guarded so unsupported devices degrade gracefully."
        },
        {
          "path": "frontend/src/components/HapticButton.tsx",
          "operation": "create",
          "description": "Create a small wrapper around shadcn-ui button behavior to trigger light haptic on press while preserving accessibility; compose shadcn-ui (do not edit immutable sources). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/BottomNav.tsx",
          "operation": "modify",
          "description": "Use HapticButton (or equivalent press handling) so navigation taps trigger light haptics when supported."
        },
        {
          "path": "frontend/src/screens/LogScreen.tsx",
          "operation": "modify",
          "description": "Trigger medium haptic on successful save and strong/special haptics for PR and rank events as specified."
        },
        {
          "path": "frontend/src/components/RankPromotionOverlay.tsx",
          "operation": "modify",
          "description": "Trigger strong haptic feedback when rank promotion animation plays (where supported)."
        },
        {
          "path": "frontend/src/components/StickmanVolumeControl.tsx",
          "operation": "modify",
          "description": "Trigger the special max-pull vibration when volume reaches 100% and the auto-drop reset occurs (where supported)."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Ensure smooth performance for animations/interactions and keep core functionality offline without unnecessary network activity.",
      "acceptanceCriteria": [
        "Core interactions (wheel scroll, save, navigation) respond immediately without blocking the main thread for noticeable durations.",
        "The app remains functional offline and does not continuously attempt background network calls for core features.",
        "No screen depends on backend calls to render core data."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WheelPicker.tsx",
          "operation": "modify",
          "description": "Optimize wheel inertial scrolling and snapping using requestAnimationFrame-driven updates, minimal React state churn, and memoization to keep interactions responsive on mobile."
        },
        {
          "path": "frontend/src/components/HistoryGraph365.tsx",
          "operation": "modify",
          "description": "Ensure graph draw animation is efficient (batched rendering, avoid heavy rerenders) and only recalculates when underlying data changes."
        },
        {
          "path": "frontend/src/components/RollingCounter.tsx",
          "operation": "modify",
          "description": "Ensure the counter animation is lightweight and does not trigger expensive layout/reflow loops; prefer transform-based animation where feasible."
        },
        {
          "path": "frontend/src/hooks/usePullupStore.ts",
          "operation": "modify",
          "description": "Add selectors/caching to prevent unnecessary rerenders across Dashboard/History/Analytics when unrelated parts of the offline store change; ensure no background network calls are initiated for core features."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Confirm all core screens render from offline state immediately and transitions remain smooth; avoid introducing any blocking network-dependent initialization for core flows."
        }
      ]
    }
  ]
}